# ApplicationEntryPoint Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ApplicationEntryPoint Class
Members See Also
---
For Revit Macros use only.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public abstract class ApplicationEntryPoint : Application,
	IEntryPoint
```

Visual Basic
---
```text
Public MustInherit Class ApplicationEntryPoint _
	Inherits Application _
	Implements IEntryPoint
```

Visual C++
---
```text
public ref class ApplicationEntryPoint abstract : public Application,
	IEntryPoint
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.ApplicationServices..::..Application Autodesk.Revit.DB.Macros..::..ApplicationEntryPoint
# See Also
ApplicationEntryPoint Members
Autodesk.Revit.DB.Macros Namespace